"""
Дан многомерный список. Вывести на экран первый и последний столбцы.
пример
исходный список
[1 6 8 5 4 0 3],
[5 7 8 9 4 2 1],
[6 0 7 8 1 2 5],
[5 7 2 7 5 2 1]

результат работы кода с задания 1
1 3
5 1
6 5
5 1
"""

S = [
    [1, 6, 8, 5, 4, 0, 3],
    [5, 7, 8, 9, 4, 2, 1],
    [6, 0, 7, 8, 1, 2, 5],
    [5, 7, 2, 7, 5, 2, 1]
]


for i in S:
    print(i[0], i[len(i)-1], '\n', end="")
