"""
Дан многомерный список. Вывести на экран все четные столбцы,
у которых первый элемент больше последнего.
пример
исходный список
[1 6 8 5 4 0 3],
[5 7 8 9 4 2 1],
[6 0 7 8 1 2 5],
[5 7 2 7 5 2 1]

результат работы кода с задания 2
8 3
8 1
7 5
2 1
"""

S = [
    [1, 6, 8, 5, 4, 0, 3],
    [5, 7, 8, 9, 4, 2, 1],
    [6, 0, 7, 8, 1, 2, 5],
    [5, 7, 2, 7, 5, 2, 1]
]


for j in range(7):
    for i in range(4):
        if S[0][j] > S[3][j]:
            print(S[i][j], end=" ")
            print()
